GopalSaraf/Practicals/PSDL/include/proc/pic18lf2680.inc
// Register: RXF13SIDL
#define RXF13SIDL RXF13SIDL
RXF13SIDL                                equ 0D85h
// bitfield definitions
RXF13SIDL_EID16_POSN                     equ 0000h
RXF13SIDL_EID16_POSITION                 equ 0000h
RXF13SIDL_EID16_SIZE                     equ 0001h
RXF13SIDL_EID16_LENGTH                   equ 0001h
RXF13SIDL_EID16_MASK                     equ 0001h
RXF13SIDL_EID17_POSN                     equ 0001h
RXF13SIDL_EID17_POSITION                 equ 0001h
RXF13SIDL_EID17_SIZE                     equ 0001h
RXF13SIDL_EID17_LENGTH                   equ 0001h
RXF13SIDL_EID17_MASK                     equ 0002h
RXF13SIDL_EXIDEN_POSN                    equ 0003h
RXF13SIDL_EXIDEN_POSITION                equ 0003h
RXF13SIDL_EXIDEN_SIZE                    equ 0001h
RXF13SIDL_EXIDEN_LENGTH                  equ 0001h
RXF13SIDL_EXIDEN_MASK                    equ 0008h
RXF13SIDL_SID0_POSN                      equ 0005h
RXF13SIDL_SID0_POSITION                  equ 0005h
RXF13SIDL_SID0_SIZE                      equ 0001h
RXF13SIDL_SID0_LENGTH                    equ 0001h
RXF13SIDL_SID0_MASK                      equ 0020h
RXF13SIDL_SID1_POSN                      equ 0006h
RXF13SIDL_SID1_POSITION                  equ 0006h
RXF13SIDL_SID1_SIZE                      equ 0001h
RXF13SIDL_SID1_LENGTH                    equ 0001h
RXF13SIDL_SID1_MASK                      equ 0040h
RXF13SIDL_SID2_POSN                      equ 0007h
RXF13SIDL_SID2_POSITION                  equ 0007h
RXF13SIDL_SID2_SIZE                      equ 0001h
RXF13SIDL_SID2_LENGTH                    equ 0001h
RXF13SIDL_SID2_MASK                      equ 0080h
RXF13SIDL_EXIDE_POSN                     equ 0003h
RXF13SIDL_EXIDE_POSITION                 equ 0003h
RXF13SIDL_EXIDE_SIZE                     equ 0001h
RXF13SIDL_EXIDE_LENGTH                   equ 0001h
RXF13SIDL_EXIDE_MASK                     equ 0008h
RXF13SIDL_RXF13EID16_POSN                equ 0000h
RXF13SIDL_RXF13EID16_POSITION            equ 0000h
RXF13SIDL_RXF13EID16_SIZE                equ 0001h
RXF13SIDL_RXF13EID16_LENGTH              equ 0001h
RXF13SIDL_RXF13EID16_MASK                equ 0001h
RXF13SIDL_RXF13EID17_POSN                equ 0001h
RXF13SIDL_RXF13EID17_POSITION            equ 0001h
RXF13SIDL_RXF13EID17_SIZE                equ 0001h
RXF13SIDL_RXF13EID17_LENGTH              equ 0001h
RXF13SIDL_RXF13EID17_MASK                equ 0002h
RXF13SIDL_RXF13EXIDEN_POSN               equ 0003h
RXF13SIDL_RXF13EXIDEN_POSITION           equ 0003h
RXF13SIDL_RXF13EXIDEN_SIZE               equ 0001h
RXF13SIDL_RXF13EXIDEN_LENGTH             equ 0001h
RXF13SIDL_RXF13EXIDEN_MASK               equ 0008h
RXF13SIDL_RXF13SID0_POSN                 equ 0005h
RXF13SIDL_RXF13SID0_POSITION             equ 0005h
RXF13SIDL_RXF13SID0_SIZE                 equ 0001h
RXF13SIDL_RXF13SID0_LENGTH               equ 0001h
RXF13SIDL_RXF13SID0_MASK                 equ 0020h
RXF13SIDL_RXF13SID1_POSN                 equ 0006h
RXF13SIDL_RXF13SID1_POSITION             equ 0006h
RXF13SIDL_RXF13SID1_SIZE                 equ 0001h
RXF13SIDL_RXF13SID1_LENGTH               equ 0001h
RXF13SIDL_RXF13SID1_MASK                 equ 0040h
RXF13SIDL_RXF13SID2_POSN                 equ 0007h
RXF13SIDL_RXF13SID2_POSITION             equ 0007h
RXF13SIDL_RXF13SID2_SIZE                 equ 0001h
RXF13SIDL_RXF13SID2_LENGTH               equ 0001h
RXF13SIDL_RXF13SID2_MASK                 equ 0080h

// Register: RXF13EIDH
#define RXF13EIDH RXF13EIDH
RXF13EIDH                                equ 0D86h
// bitfield definitions
RXF13EIDH_EID8_POSN                      equ 0000h
RXF13EIDH_EID8_POSITION                  equ 0000h
RXF13EIDH_EID8_SIZE                      equ 0001h
RXF13EIDH_EID8_LENGTH                    equ 0001h
RXF13EIDH_EID8_MASK                      equ 0001h
RXF13EIDH_EID9_POSN                      equ 0001h
RXF13EIDH_EID9_POSITION                  equ 0001h
RXF13EIDH_EID9_SIZE                      equ 0001h
RXF13EIDH_EID9_LENGTH                    equ 0001h
RXF13EIDH_EID9_MASK                      equ 0002h
RXF13EIDH_EID10_POSN                     equ 0002h
RXF13EIDH_EID10_POSITION                 equ 0002h
RXF13EIDH_EID10_SIZE                     equ 0001h
RXF13EIDH_EID10_LENGTH                   equ 0001h
RXF13EIDH_EID10_MASK                     equ 0004h
RXF13EIDH_EID11_POSN                     equ 0003h
RXF13EIDH_EID11_POSITION                 equ 0003h
RXF13EIDH_EID11_SIZE                     equ 0001h
RXF13EIDH_EID11_LENGTH                   equ 0001h
RXF13EIDH_EID11_MASK                     equ 0008h
RXF13EIDH_EID12_POSN                     equ 0004h
RXF13EIDH_EID12_POSITION                 equ 0004h
RXF13EIDH_EID12_SIZE                     equ 0001h
RXF13EIDH_EID12_LENGTH                   equ 0001h
RXF13EIDH_EID12_MASK                     equ 0010h
RXF13EIDH_EID13_POSN                     equ 0005h
RXF13EIDH_EID13_POSITION                 equ 0005h
RXF13EIDH_EID13_SIZE                     equ 0001h
RXF13EIDH_EID13_LENGTH                   equ 0001h
RXF13EIDH_EID13_MASK                     equ 0020h
RXF13EIDH_EID14_POSN                     equ 0006h
RXF13EIDH_EID14_POSITION                 equ 0006h
RXF13EIDH_EID14_SIZE                     equ 0001h
RXF13EIDH_EID14_LENGTH                   equ 0001h
RXF13EIDH_EID14_MASK                     equ 0040h
RXF13EIDH_EID15_POSN                     equ 0007h
RXF13EIDH_EID15_POSITION                 equ 0007h
RXF13EIDH_EID15_SIZE                     equ 0001h
RXF13EIDH_EID15_LENGTH                   equ 0001h
RXF13EIDH_EID15_MASK                     equ 0080h
RXF13EIDH_RXF13EID8_POSN                 equ 0000h
RXF13EIDH_RXF13EID8_POSITION             equ 0000h
RXF13EIDH_RXF13EID8_SIZE                 equ 0001h
RXF13EIDH_RXF13EID8_LENGTH               equ 0001h
RXF13EIDH_RXF13EID8_MASK                 equ 0001h
RXF13EIDH_RXF13EID9_POSN                 equ 0001h
RXF13EIDH_RXF13EID9_POSITION             equ 0001h
RXF13EIDH_RXF13EID9_SIZE                 equ 0001h
RXF13EIDH_RXF13EID9_LENGTH               equ 0001h
RXF13EIDH_RXF13EID9_MASK                 equ 0002h
RXF13EIDH_RXF13EID10_POSN                equ 0002h
RXF13EIDH_RXF13EID10_POSITION            equ 0002h
RXF13EIDH_RXF13EID10_SIZE                equ 0001h
RXF13EIDH_RXF13EID10_LENGTH              equ 0001h
RXF13EIDH_RXF13EID10_MASK                equ 0004h
RXF13EIDH_RXF13EID11_POSN                equ 0003h
RXF13EIDH_RXF13EID11_POSITION            equ 0003h
RXF13EIDH_RXF13EID11_SIZE                equ 0001h
RXF13EIDH_RXF13EID11_LENGTH              equ 0001h
RXF13EIDH_RXF13EID11_MASK                equ 0008h
RXF13EIDH_RXF13EID12_POSN                equ 0004h
RXF13EIDH_RXF13EID12_POSITION            equ 0004h
RXF13EIDH_RXF13EID12_SIZE                equ 0001h
RXF13EIDH_RXF13EID12_LENGTH              equ 0001h
RXF13EIDH_RXF13EID12_MASK                equ 0010h
RXF13EIDH_RXF13EID13_POSN                equ 0005h
RXF13EIDH_RXF13EID13_POSITION            equ 0005h
RXF13EIDH_RXF13EID13_SIZE                equ 0001h
RXF13EIDH_RXF13EID13_LENGTH              equ 0001h
RXF13EIDH_RXF13EID13_MASK                equ 0020h
RXF13EIDH_RXF13EID14_POSN                equ 0006h
RXF13EIDH_RXF13EID14_POSITION            equ 0006h
RXF13EIDH_RXF13EID14_SIZE                equ 0001h
RXF13EIDH_RXF13EID14_LENGTH              equ 0001h
RXF13EIDH_RXF13EID14_MASK                equ 0040h
RXF13EIDH_RXF13EID15_POSN                equ 0007h
RXF13EIDH_RXF13EID15_POSITION            equ 0007h
RXF13EIDH_RXF13EID15_SIZE                equ 0001h
RXF13EIDH_RXF13EID15_LENGTH              equ 0001h
RXF13EIDH_RXF13EID15_MASK                equ 0080h

// Register: RXF13EIDL
#define RXF13EIDL RXF13EIDL
RXF13EIDL                                equ 0D87h
// bitfield definitions
RXF13EIDL_EID0_POSN                      equ 0000h
RXF13EIDL_EID0_POSITION                  equ 0000h
RXF13EIDL_EID0_SIZE                      equ 0001h
RXF13EIDL_EID0_LENGTH                    equ 0001h
RXF13EIDL_EID0_MASK                      equ 0001h
RXF13EIDL_EID1_POSN                      equ 0001h
RXF13EIDL_EID1_POSITION                  equ 0001h
RXF13EIDL_EID1_SIZE                      equ 0001h
RXF13EIDL_EID1_LENGTH                    equ 0001h
RXF13EIDL_EID1_MASK                      equ 0002h
RXF13EIDL_EID2_POSN                      equ 0002h
RXF13EIDL_EID2_POSITION                  equ 0002h
RXF13EIDL_EID2_SIZE                      equ 0001h
RXF13EIDL_EID2_LENGTH                    equ 0001h
RXF13EIDL_EID2_MASK                      equ 0004h
RXF13EIDL_EID3_POSN                      equ 0003h
RXF13EIDL_EID3_POSITION                  equ 0003h
RXF13EIDL_EID3_SIZE                      equ 0001h
RXF13EIDL_EID3_LENGTH                    equ 0001h
RXF13EIDL_EID3_MASK                      equ 0008h
RXF13EIDL_EID4_POSN                      equ 0004h
RXF13EIDL_EID4_POSITION                  equ 0004h
RXF13EIDL_EID4_SIZE                      equ 0001h
RXF13EIDL_EID4_LENGTH                    equ 0001h
RXF13EIDL_EID4_MASK                      equ 0010h
RXF13EIDL_EID5_POSN                      equ 0005h
RXF13EIDL_EID5_POSITION                  equ 0005h
RXF13EIDL_EID5_SIZE                      equ 0001h
RXF13EIDL_EID5_LENGTH                    equ 0001h
RXF13EIDL_EID5_MASK                      equ 0020h
RXF13EIDL_EID6_POSN                      equ 0006h
RXF13EIDL_EID6_POSITION                  equ 0006h
RXF13EIDL_EID6_SIZE                      equ 0001h
RXF13EIDL_EID6_LENGTH                    equ 0001h
RXF13EIDL_EID6_MASK                      equ 0040h
RXF13EIDL_EID7_POSN                      equ 0007h
RXF13EIDL_EID7_POSITION                  equ 0007h
RXF13EIDL_EID7_SIZE                      equ 0001h
RXF13EIDL_EID7_LENGTH                    equ 0001h
RXF13EIDL_EID7_MASK                      equ 0080h
RXF13EIDL_RXF13EID0_POSN                 equ 0000h
RXF13EIDL_RXF13EID0_POSITION             equ 0000h
RXF13EIDL_RXF13EID0_SIZE                 equ 0001h
RXF13EIDL_RXF13EID0_LENGTH               equ 0001h
RXF13EIDL_RXF13EID0_MASK                 equ 0001h
RXF13EIDL_RXF13EID1_POSN                 equ 0001h
RXF13EIDL_RXF13EID1_POSITION             equ 0001h
RXF13EIDL_RXF13EID1_SIZE                 equ 0001h
RXF13EIDL_RXF13EID1_LENGTH               equ 0001h
RXF13EIDL_RXF13EID1_MASK                 equ 0002h
RXF13EIDL_RXF13EID2_POSN                 equ 0002h
RXF13EIDL_RXF13EID2_POSITION             equ 0002h
RXF13EIDL_RXF13EID2_SIZE                 equ 0001h
RXF13EIDL_RXF13EID2_LENGTH               equ 0001h
RXF13EIDL_RXF13EID2_MASK                 equ 0004h
RXF13EIDL_RXF13EID3_POSN                 equ 0003h
RXF13EIDL_RXF13EID3_POSITION             equ 0003h
RXF13EIDL_RXF13EID3_SIZE                 equ 0001h
RXF13EIDL_RXF13EID3_LENGTH               equ 0001h
RXF13EIDL_RXF13EID3_MASK                 equ 0008h
RXF13EIDL_RXF13EID4_POSN                 equ 0004h
RXF13EIDL_RXF13EID4_POSITION             equ 0004h
RXF13EIDL_RXF13EID4_SIZE                 equ 0001h
RXF13EIDL_RXF13EID4_LENGTH               equ 0001h
RXF13EIDL_RXF13EID4_MASK                 equ 0010h
RXF13EIDL_RXF13EID5_POSN                 equ 0005h
RXF13EIDL_RXF13EID5_POSITION             equ 0005h
RXF13EIDL_RXF13EID5_SIZE                 equ 0001h
RXF13EIDL_RXF13EID5_LENGTH               equ 0001h
RXF13EIDL_RXF13EID5_MASK                 equ 0020h
RXF13EIDL_RXF13EID6_POSN                 equ 0006h
RXF13EIDL_RXF13EID6_POSITION             equ 0006h
RXF13EIDL_RXF13EID6_SIZE                 equ 0001h
RXF13EIDL_RXF13EID6_LENGTH               equ 0001h
RXF13EIDL_RXF13EID6_MASK                 equ 0040h
RXF13EIDL_RXF13EID7_POSN                 equ 0007h
RXF13EIDL_RXF13EID7_POSITION             equ 0007h
RXF13EIDL_RXF13EID7_SIZE                 equ 0001h
RXF13EIDL_RXF13EID7_LENGTH               equ 0001h
RXF13EIDL_RXF13EID7_MASK                 equ 0080h

// Register: RXF14SIDH
#define RXF14SIDH RXF14SIDH
RXF14SIDH                                equ 0D88h
// bitfield definitions
RXF14SIDH_SID3_POSN                      equ 0000h
RXF14SIDH_SID3_POSITION                  equ 0000h
RXF14SIDH_SID3_SIZE                      equ 0001h
RXF14SIDH_SID3_LENGTH                    equ 0001h
RXF14SIDH_SID3_MASK                      equ 0001h
RXF14SIDH_SID4_POSN                      equ 0001h
RXF14SIDH_SID4_POSITION                  equ 0001h
RXF14SIDH_SID4_SIZE                      equ 0001h
RXF14SIDH_SID4_LENGTH                    equ 0001h
RXF14SIDH_SID4_MASK                      equ 0002h
RXF14SIDH_SID5_POSN                      equ 0002h
RXF14SIDH_SID5_POSITION                  equ 0002h
RXF14SIDH_SID5_SIZE                      equ 0001h
RXF14SIDH_SID5_LENGTH                    equ 0001h
RXF14SIDH_SID5_MASK                      equ 0004h
RXF14SIDH_SID6_POSN                      equ 0003h
RXF14SIDH_SID6_POSITION                  equ 0003h
RXF14SIDH_SID6_SIZE                      equ 0001h
RXF14SIDH_SID6_LENGTH                    equ 0001h
RXF14SIDH_SID6_MASK                      equ 0008h
RXF14SIDH_SID7_POSN                      equ 0004h
RXF14SIDH_SID7_POSITION                  equ 0004h
RXF14SIDH_SID7_SIZE                      equ 0001h
RXF14SIDH_SID7_LENGTH                    equ 0001h
RXF14SIDH_SID7_MASK                      equ 0010h
RXF14SIDH_SID8_POSN                      equ 0005h
RXF14SIDH_SID8_POSITION                  equ 0005h
RXF14SIDH_SID8_SIZE                      equ 0001h
RXF14SIDH_SID8_LENGTH                    equ 0001h
RXF14SIDH_SID8_MASK                      equ 0020h
RXF14SIDH_SID9_POSN                      equ 0006h
RXF14SIDH_SID9_POSITION                  equ 0006h
RXF14SIDH_SID9_SIZE                      equ 0001h
RXF14SIDH_SID9_LENGTH                    equ 0001h
RXF14SIDH_SID9_MASK                      equ 0040h
RXF14SIDH_SID10_POSN                     equ 0007h
RXF14SIDH_SID10_POSITION                 equ 0007h
RXF14SIDH_SID10_SIZE                     equ 0001h
RXF14SIDH_SID10_LENGTH                   equ 0001h
RXF14SIDH_SID10_MASK                     equ 0080h
RXF14SIDH_RXF14SID3_POSN                 equ 0000h
RXF14SIDH_RXF14SID3_POSITION             equ 0000h
RXF14SIDH_RXF14SID3_SIZE                 equ 0001h
RXF14SIDH_RXF14SID3_LENGTH               equ 0001h
RXF14SIDH_RXF14SID3_MASK                 equ 0001h
RXF14SIDH_RXF14SID4_POSN                 equ 0001h
RXF14SIDH_RXF14SID4_POSITION             equ 0001h
RXF14SIDH_RXF14SID4_SIZE                 equ 0001h
RXF14SIDH_RXF14SID4_LENGTH               equ 0001h
RXF14SIDH_RXF14SID4_MASK                 equ 0002h
RXF14SIDH_RXF14SID5_POSN                 equ 0002h
RXF14SIDH_RXF14SID5_POSITION             equ 0002h
RXF14SIDH_RXF14SID5_SIZE                 equ 0001h
RXF14SIDH_RXF14SID5_LENGTH               equ 0001h
RXF14SIDH_RXF14SID5_MASK                 equ 0004h
RXF14SIDH_RXF14SID6_POSN                 equ 0003h
RXF14SIDH_RXF14SID6_POSITION             equ 0003h
RXF14SIDH_RXF14SID6_SIZE                 equ 0001h
RXF14SIDH_RXF14SID6_LENGTH               equ 0001h
RXF14SIDH_RXF14SID6_MASK                 equ 0008h
RXF14SIDH_RXF14SID7_POSN                 equ 0004h
RXF14SIDH_RXF14SID7_POSITION             equ 0004h
RXF14SIDH_RXF14SID7_SIZE                 equ 0001h
RXF14SIDH_RXF14SID7_LENGTH               equ 0001h
RXF14SIDH_RXF14SID7_MASK                 equ 0010h
RXF14SIDH_RXF14SID8_POSN                 equ 0005h
RXF14SIDH_RXF14SID8_POSITION             equ 0005h
RXF14SIDH_RXF14SID8_SIZE                 equ 0001h
RXF14SIDH_RXF14SID8_LENGTH               equ 0001h
RXF14SIDH_RXF14SID8_MASK                 equ 0020h
RXF14SIDH_RXF14SID9_POSN                 equ 0006h
RXF14SIDH_RXF14SID9_POSITION             equ 0006h
RXF14SIDH_RXF14SID9_SIZE                 equ 0001h
RXF14SIDH_RXF14SID9_LENGTH               equ 0001h
RXF14SIDH_RXF14SID9_MASK                 equ 0040h
RXF14SIDH_RXF14SID10_POSN                equ 0007h
RXF14SIDH_RXF14SID10_POSITION            equ 0007h
RXF14SIDH_RXF14SID10_SIZE                equ 0001h
RXF14SIDH_RXF14SID10_LENGTH              equ 0001h
RXF14SIDH_RXF14SID10_MASK                equ 0080h

